;==========================================================
; NEW ITEMS -----------------------------------------------
;==========================================================
[ArcticRounds X2AmmoTemplate]
FriendlyName="Arctic Rounds"
FriendlyNamePlural="Arctic Rounds"
BriefSummary="These rounds release highly endothermic chemical agents capable of absorbing heat at an outstanding speed, chilling organic targets on impact and dealing bonus damage."
TacticalText="<Bullet/> These rounds do extra damage and can chill any organic target that they hit.\n<Bullet/> Arctic rounds have a small chance to freeze targets.\n<Bullet/> Chilled targets are more susceptible to get frozen."

[FrostbombMk2 X2GrenadeTemplate]
FriendlyName="Frost Bomb"
FriendlyNamePlural="Frost Bombs"
BriefSummary="The cryogenic compound in the upgraded Frost Bomb increases the heat absorption radius even further, chilling organic targets on contact and freezing units caught in the center of explosion."
TacticalText="<Bullet/> Frost bombs chill non-metallic units in the blast radius, reducing their mobility and negating their dodge chance.\n<Bullet/> Units caught in the center of explosion will be frozen, preventing them from taking any actions for one turn."
ThrownAbilityName="Throw Frost Bomb"
ThrownAbilityHelpText="Chill and freeze all units in the target area."
LaunchedAbilityname="Launch Frost Bomb"
LaunchedAbilityHelpText="Chill and freeze all units in the target area."

[FrostbombMk3 X2GrenadeTemplate]
FriendlyName="Frost Warhead"
FriendlyNamePlural="Frost Warhead"
BriefSummary="The upgraded Frost Warhead boasts significant improvements in explosive capacity, further extending the initial blast radius and inflicting devastating frost effects to organic units."
TacticalText="<Bullet/> Frost warheads chill non-metallic units in the blast radius, reducing their mobility and negating their dodge chance.\n<Bullet/> Units caught in the center of explosion will be frozen, preventing them from taking any actions for one turn."
ThrownAbilityName="Throw Frost Warhead"
ThrownAbilityHelpText="Chill and freeze all units in the target area."
LaunchedAbilityname="Launch Frost Warhead"
LaunchedAbilityHelpText="Chill and freeze all units in the target area."

;==========================================================
; VANILLA OVERRIDE ----------------------------------------
;==========================================================
[Frostbomb X2GrenadeTemplate]
FriendlyName="Frost Grenade"
FriendlyNamePlural="Frost Grenades"
BriefSummary="Relying on endothermic chemical agents, these hand-held explosives seem capable of instantaneously reducing the ambient temperature of the surrounding area. Exposed tissue will be chilled on contact."
TacticalText="<Bullet/> Frost grenades chill non-metallic units in the blast radius, reducing their mobility and negating their dodge chance.\n<Bullet/> Units caught in the center of explosion will be frozen, preventing them from taking any actions for one turn."
ThrownAbilityName="Throw Frost Grenade"
ThrownAbilityHelpText="Chill and freeze all units in the target area."
LaunchedAbilityname="Launch Frost Grenade"
LaunchedAbilityHelpText="Chill and freeze all units in the target area."

[HazmatVest X2EquipmentTemplate]
FriendlyName="Hazmat Vest"
FriendlyNamePlural="Hazmat Vests"
BriefSummary="By reinforcing the Nanoscale Vest with specialized materials, soldiers gain an additional health boost and are completely resistant to any environmental hazards like fire, poison, acid or frost."
TacticalText="<Bullet/> Increases soldier health.\n<Bullet/> Provides immunity to fire, poison, acid and frost."

[Fortress X2AbilityTemplate]
LocFriendlyName="Fortress"
LocLongDescription="The <Ability:ClassName/> is immune to fire, poison, acid, frost and explosive damage."
LocHelpText="The <Ability:ClassName/> is immune to fire, poison, acid, frost and explosive damage."
LocFlyOverText="Fortress"
LocPromotionPopupText="<Bullet/> A <Ability:ClassName/> with the Fortress ability can walk through fire, poison and acid with no ill effects.<br/>"